ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DB48def.inc
; EVSYS_CHANNEL4 masks
.equ EVSYS_CHANNEL4_gm = 0xFF            ; Channel 4 generator select group mask
.equ EVSYS_CHANNEL4_gp = 0               ; Channel 4 generator select group position
.equ EVSYS_CHANNEL4_0_bm = (1<<0)        ; Channel 4 generator select bit 0 mask
.equ EVSYS_CHANNEL4_0_bp = 0             ; Channel 4 generator select bit 0 position
.equ EVSYS_CHANNEL4_1_bm = (1<<1)        ; Channel 4 generator select bit 1 mask
.equ EVSYS_CHANNEL4_1_bp = 1             ; Channel 4 generator select bit 1 position
.equ EVSYS_CHANNEL4_2_bm = (1<<2)        ; Channel 4 generator select bit 2 mask
.equ EVSYS_CHANNEL4_2_bp = 2             ; Channel 4 generator select bit 2 position
.equ EVSYS_CHANNEL4_3_bm = (1<<3)        ; Channel 4 generator select bit 3 mask
.equ EVSYS_CHANNEL4_3_bp = 3             ; Channel 4 generator select bit 3 position
.equ EVSYS_CHANNEL4_4_bm = (1<<4)        ; Channel 4 generator select bit 4 mask
.equ EVSYS_CHANNEL4_4_bp = 4             ; Channel 4 generator select bit 4 position
.equ EVSYS_CHANNEL4_5_bm = (1<<5)        ; Channel 4 generator select bit 5 mask
.equ EVSYS_CHANNEL4_5_bp = 5             ; Channel 4 generator select bit 5 position
.equ EVSYS_CHANNEL4_6_bm = (1<<6)        ; Channel 4 generator select bit 6 mask
.equ EVSYS_CHANNEL4_6_bp = 6             ; Channel 4 generator select bit 6 position
.equ EVSYS_CHANNEL4_7_bm = (1<<7)        ; Channel 4 generator select bit 7 mask
.equ EVSYS_CHANNEL4_7_bp = 7             ; Channel 4 generator select bit 7 position

; EVSYS_CHANNEL5 masks
.equ EVSYS_CHANNEL5_gm = 0xFF            ; Channel 5 generator select group mask
.equ EVSYS_CHANNEL5_gp = 0               ; Channel 5 generator select group position
.equ EVSYS_CHANNEL5_0_bm = (1<<0)        ; Channel 5 generator select bit 0 mask
.equ EVSYS_CHANNEL5_0_bp = 0             ; Channel 5 generator select bit 0 position
.equ EVSYS_CHANNEL5_1_bm = (1<<1)        ; Channel 5 generator select bit 1 mask
.equ EVSYS_CHANNEL5_1_bp = 1             ; Channel 5 generator select bit 1 position
.equ EVSYS_CHANNEL5_2_bm = (1<<2)        ; Channel 5 generator select bit 2 mask
.equ EVSYS_CHANNEL5_2_bp = 2             ; Channel 5 generator select bit 2 position
.equ EVSYS_CHANNEL5_3_bm = (1<<3)        ; Channel 5 generator select bit 3 mask
.equ EVSYS_CHANNEL5_3_bp = 3             ; Channel 5 generator select bit 3 position
.equ EVSYS_CHANNEL5_4_bm = (1<<4)        ; Channel 5 generator select bit 4 mask
.equ EVSYS_CHANNEL5_4_bp = 4             ; Channel 5 generator select bit 4 position
.equ EVSYS_CHANNEL5_5_bm = (1<<5)        ; Channel 5 generator select bit 5 mask
.equ EVSYS_CHANNEL5_5_bp = 5             ; Channel 5 generator select bit 5 position
.equ EVSYS_CHANNEL5_6_bm = (1<<6)        ; Channel 5 generator select bit 6 mask
.equ EVSYS_CHANNEL5_6_bp = 6             ; Channel 5 generator select bit 6 position
.equ EVSYS_CHANNEL5_7_bm = (1<<7)        ; Channel 5 generator select bit 7 mask
.equ EVSYS_CHANNEL5_7_bp = 7             ; Channel 5 generator select bit 7 position

; EVSYS_CHANNEL6 masks
.equ EVSYS_CHANNEL6_gm = 0xFF            ; Channel 6 generator select group mask
.equ EVSYS_CHANNEL6_gp = 0               ; Channel 6 generator select group position
.equ EVSYS_CHANNEL6_0_bm = (1<<0)        ; Channel 6 generator select bit 0 mask
.equ EVSYS_CHANNEL6_0_bp = 0             ; Channel 6 generator select bit 0 position
.equ EVSYS_CHANNEL6_1_bm = (1<<1)        ; Channel 6 generator select bit 1 mask
.equ EVSYS_CHANNEL6_1_bp = 1             ; Channel 6 generator select bit 1 position
.equ EVSYS_CHANNEL6_2_bm = (1<<2)        ; Channel 6 generator select bit 2 mask
.equ EVSYS_CHANNEL6_2_bp = 2             ; Channel 6 generator select bit 2 position
.equ EVSYS_CHANNEL6_3_bm = (1<<3)        ; Channel 6 generator select bit 3 mask
.equ EVSYS_CHANNEL6_3_bp = 3             ; Channel 6 generator select bit 3 position
.equ EVSYS_CHANNEL6_4_bm = (1<<4)        ; Channel 6 generator select bit 4 mask
.equ EVSYS_CHANNEL6_4_bp = 4             ; Channel 6 generator select bit 4 position
.equ EVSYS_CHANNEL6_5_bm = (1<<5)        ; Channel 6 generator select bit 5 mask
.equ EVSYS_CHANNEL6_5_bp = 5             ; Channel 6 generator select bit 5 position
.equ EVSYS_CHANNEL6_6_bm = (1<<6)        ; Channel 6 generator select bit 6 mask
.equ EVSYS_CHANNEL6_6_bp = 6             ; Channel 6 generator select bit 6 position
.equ EVSYS_CHANNEL6_7_bm = (1<<7)        ; Channel 6 generator select bit 7 mask
.equ EVSYS_CHANNEL6_7_bp = 7             ; Channel 6 generator select bit 7 position

; EVSYS_CHANNEL7 masks
.equ EVSYS_CHANNEL7_gm = 0xFF            ; Channel 7 generator select group mask
.equ EVSYS_CHANNEL7_gp = 0               ; Channel 7 generator select group position
.equ EVSYS_CHANNEL7_0_bm = (1<<0)        ; Channel 7 generator select bit 0 mask
.equ EVSYS_CHANNEL7_0_bp = 0             ; Channel 7 generator select bit 0 position
.equ EVSYS_CHANNEL7_1_bm = (1<<1)        ; Channel 7 generator select bit 1 mask
.equ EVSYS_CHANNEL7_1_bp = 1             ; Channel 7 generator select bit 1 position
.equ EVSYS_CHANNEL7_2_bm = (1<<2)        ; Channel 7 generator select bit 2 mask
.equ EVSYS_CHANNEL7_2_bp = 2             ; Channel 7 generator select bit 2 position
.equ EVSYS_CHANNEL7_3_bm = (1<<3)        ; Channel 7 generator select bit 3 mask
.equ EVSYS_CHANNEL7_3_bp = 3             ; Channel 7 generator select bit 3 position
.equ EVSYS_CHANNEL7_4_bm = (1<<4)        ; Channel 7 generator select bit 4 mask
.equ EVSYS_CHANNEL7_4_bp = 4             ; Channel 7 generator select bit 4 position
.equ EVSYS_CHANNEL7_5_bm = (1<<5)        ; Channel 7 generator select bit 5 mask
.equ EVSYS_CHANNEL7_5_bp = 5             ; Channel 7 generator select bit 5 position
.equ EVSYS_CHANNEL7_6_bm = (1<<6)        ; Channel 7 generator select bit 6 mask
.equ EVSYS_CHANNEL7_6_bp = 6             ; Channel 7 generator select bit 6 position
.equ EVSYS_CHANNEL7_7_bm = (1<<7)        ; Channel 7 generator select bit 7 mask
.equ EVSYS_CHANNEL7_7_bp = 7             ; Channel 7 generator select bit 7 position

